Hey this looks good to me! This is what the terraform plan would look like if using this version of the modules (`notebook_cluster` and `emr_debugging`) :

```
Terraform will perform the following actions:

  # module.emr_debugging[0].data.aws_iam_policy_document.notebook_logs_access_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notebook_logs_access_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:Get*",
              + "s3:List*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::971765365473:role/tecton-convoy-featurestore-cross-account-role",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.emr_debugging[0].aws_s3_bucket_policy.notebook_logs_read_only_access will be created
  + resource "aws_s3_bucket_policy" "notebook_logs_read_only_access" {
      + bucket = "tecton-convoy-featurestore-notebook"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.notebook_cluster[0].aws_emr_cluster.cluster must be replaced
-/+ resource "aws_emr_cluster" "cluster" {
      ~ arn                               = "arn:aws:elasticmapreduce:us-west-2:971765365473:cluster/j-9A58I49LK0L3" -> (known after apply)
      ~ cluster_state                     = "WAITING" -> (known after apply)
      - ebs_root_volume_size              = 0 -> null
      ~ id                                = "j-9A58I49LK0L3" -> (known after apply)
      ~ keep_job_flow_alive_when_no_steps = true -> (known after apply)
      + log_uri                           = "s3n://tecton-convoy-featurestore-notebook/" # forces replacement
      ~ master_public_dns                 = "ip-10-38-2-183.us-west-2.compute.internal" -> (known after apply)
        name                              = "tecton-convoy-featurestore-notebook-cluster"
      ~ scale_down_behavior               = "TERMINATE_AT_TASK_COMPLETION" -> (known after apply)
      ~ step                              = [
          ~ {
              ~ hadoop_jar_step   = [
                  ~ {
                      ~ main_class = "" -> null
                      ~ properties = {} -> null
                        # (2 unchanged elements hidden)
                    },
                ]
                name              = "Setup Hadoop Debugging"
                # (1 unchanged element hidden)
            },
        ]
        tags                              = {
            "notebook"                              = "true"
            "tecton-accessible:convoy-featurestore" = "true"
            "tecton-owned"                          = "true"
        }
      ~ termination_protection            = false -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ bootstrap_action {
          - args = [] -> null
            name = "tecton_emr_setup"
            # (1 unchanged attribute hidden)
        }

      + core_instance_fleet {
          + id                             = (known after apply)
          + name                           = (known after apply)
          + provisioned_on_demand_capacity = (known after apply)
          + provisioned_spot_capacity      = (known after apply)
          + target_on_demand_capacity      = (known after apply)
          + target_spot_capacity           = (known after apply)

          + instance_type_configs {
              + bid_price                                  = (known after apply)
              + bid_price_as_percentage_of_on_demand_price = (known after apply)
              + instance_type                              = (known after apply)
              + weighted_capacity                          = (known after apply)

              + configurations {
                  + classification = (known after apply)
                  + properties     = (known after apply)
                }

              + ebs_config {
                  + iops                 = (known after apply)
                  + size                 = (known after apply)
                  + type                 = (known after apply)
                  + volumes_per_instance = (known after apply)
                }
            }

          + launch_specifications {
              + on_demand_specification {
                  + allocation_strategy = (known after apply)
                }

              + spot_specification {
                  + allocation_strategy      = (known after apply)
                  + block_duration_minutes   = (known after apply)
                  + timeout_action           = (known after apply)
                  + timeout_duration_minutes = (known after apply)
                }
            }
        }

      ~ core_instance_group {
          ~ id             = "ig-1QYZPV7JKEQKD" -> (known after apply)
            # (2 unchanged attributes hidden)

          - ebs_config {
              - iops                 = 0 -> null
              - size                 = 40 -> null
              - type                 = "gp2" -> null
              - volumes_per_instance = 1 -> null
            }
          + ebs_config {
              + size                 = 40
              + type                 = "gp2"
              + volumes_per_instance = 1
            }
        }

      ~ ec2_attributes {
          ~ subnet_ids                        = [
              - "subnet-0391fc0d641113d24",
            ] -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      + master_instance_fleet {
          + id                             = (known after apply)
          + name                           = (known after apply)
          + provisioned_on_demand_capacity = (known after apply)
          + provisioned_spot_capacity      = (known after apply)
          + target_on_demand_capacity      = (known after apply)
          + target_spot_capacity           = (known after apply)

          + instance_type_configs {
              + bid_price                                  = (known after apply)
              + bid_price_as_percentage_of_on_demand_price = (known after apply)
              + instance_type                              = (known after apply)
              + weighted_capacity                          = (known after apply)

              + configurations {
                  + classification = (known after apply)
                  + properties     = (known after apply)
                }

              + ebs_config {
                  + iops                 = (known after apply)
                  + size                 = (known after apply)
                  + type                 = (known after apply)
                  + volumes_per_instance = (known after apply)
                }
            }

          + launch_specifications {
              + on_demand_specification {
                  + allocation_strategy = (known after apply)
                }

              + spot_specification {
                  + allocation_strategy      = (known after apply)
                  + block_duration_minutes   = (known after apply)
                  + timeout_action           = (known after apply)
                  + timeout_duration_minutes = (known after apply)
                }
            }
        }

      ~ master_instance_group {
          ~ id             = "ig-2J05IPM40A44J" -> (known after apply)
            # (2 unchanged attributes hidden)

          - ebs_config {
              - iops                 = 0 -> null
              - size                 = 32 -> null
              - type                 = "gp2" -> null
              - volumes_per_instance = 4 -> null
            }
          + ebs_config {
              + iops                 = (known after apply)
              + size                 = (known after apply)
              + type                 = (known after apply)
              + volumes_per_instance = (known after apply)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.notebook_cluster[0].aws_s3_bucket.tecton_notebook_cluster_logs will be created
  + resource "aws_s3_bucket" "tecton_notebook_cluster_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "tecton-convoy-featurestore-notebook"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "notebook"                              = "true"
          + "tecton-accessible:convoy-featurestore" = "false"
          + "tecton-owned"                          = "false"
        }
      + tags_all                    = {
          + "notebook"                              = "true"
          + "tecton-accessible:convoy-featurestore" = "false"
          + "tecton-owned"                          = "false"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```